// 1. Об’явити масив з довільними елементами. За допомогою циклу вивести всі елементи масиву послідовно в консоль

const array = [1, 2, 3, 4, 5, 6];
for (let i = 0; i < array.length; i++) {
    console.log(array[i])
}

// 2. Дан масив з цілими числами. За допомогою циклу вивести елементи масива, які є простими числами



//3.  Дано два масива: [1, 2, 3] і [4, 5, 6]. Об'єднати їх разом 

const arr1 = [1, 2, 3];
const arr2 = [4, 5, 6];

const arr3 = arr1.concat(arr2);

// 4. Даний масив [6, 5, 4]. Зробити з нього масив [4, 5,6]




// 5. Даний масив [1, 2, 3]. Додати йому в кінець елементи 4, 5, 6

const arr5 = [1, 2, 3];
arr5.push(4, 5, 6);

// 6. Даний масив [7, 8, 9]. Додати йому на початок 1, 2, 3

const arr6 = [7, 8, 9];
arr6.unshift(1, 2, 3);

// 7. Даний масив ['aaa', 'bbb', 'ccc']. Виведіть в консоль перший елемент та видаліть його.

const arr7 = ['aaa', 'bbb', 'ccc'];
arr7.shift();

// 8. Даний масив ['aaa', 'bbb', 'ccc']. Виведіть в консоль та видаліть останній елемент

const arr8 = ['aaa', 'bbb', 'ccc'];
arr8.pop();

// 9. Даний масив [9, 10, 11, 12, 13]. Скопіювати в новий масив елементи з другого по п'ятий



// 10. З масиву [1, 2, 3, 4, 5] зробити масив [1, 4, 5] (оригінальний має змінитись)



// 11. З масиву [1, 2, 3, 4, 5] скопіювати в новий масив [3, 4, 5]



// 12. З масиву  [1, 2, 3, 4, 5] (не однією командою) зробити масив [1, 'w', 'trtr', 2, 3, 4, 'vvv', 'a', 'hello']
